
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |        2 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                              |
|:--------:|:---------------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner-pem-493370826424-uw1.aws_secretsmanager_secret.secret`          |
|    🟢    | `module.actions-runner-pem-493370826424-uw1.aws_secretsmanager_secret_version.current` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner-pem-493370826424-uw1.data.external.secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/actions-runner-pem-493370826424-uw1/assets/get_secret.py",
          + "us-west-1",
          + (known after apply),
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.actions-runner-pem-493370826424-uw1.aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                            = (known after apply)
      + description                    = "A copy of infrahouse-github-terraform App private key (pem) for actions-runner tests"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "action-runner-pem-"
      + policy                         = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Condition = {
                          + ArnLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalArn" = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + recovery_window_in_days        = 0
      + tags                           = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/secret/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }
      + tags_all                       = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse8/github-control"
          + "created_by_module" = "infrahouse/secret/aws"
          + "environment"       = "production"
          + "owner"             = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
          + "service"           = "unknown"
        }

      + replica (known after apply)
    }

  # module.actions-runner-pem-493370826424-uw1.aws_secretsmanager_secret_version.current will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = [
          + "AWSCURRENT",
        ]
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Invalid Attribute Combination

  with module.infrahouse-github-backup.aws_s3_bucket_lifecycle_configuration.infrahouse-backup,
  on .terraform/modules/infrahouse-github-backup/s3.tf line 36, in resource "aws_s3_bucket_lifecycle_configuration" "infrahouse-backup":
  36:     filter {}

No attribute specified when one (and only one) of
[rule[0].filter[0].prefix.<.object_size_greater_than,rule[0].filter[0].prefix.<.object_size_less_than,rule[0].filter[0].prefix.<.and,rule[0].filter[0].prefix.<.tag]
is required

This will be an error in a future version of the provider

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogMiwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19
```
</details>